GBeetle/NRF24-USB-Debug/src/esp32_cdc.c
/*
 * This file is part of welkin project (https://github.com/GBeetle/welkin).
 * Copyright (c) 2022 GBeetle.
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, version 3.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */

#include <string.h>
#include <stdio.h>
#include "esp32_cdc.h"
#include <libusb-1.0/libusb.h>
#include <stdbool.h>

/* LIBUSB_CALL ensures the right calling conventions on libusb callbacks.
 * However, the macro is not defined everywhere. m(
 */
#ifndef LIBUSB_CALL
#define LIBUSB_CALL
#endif

/* Number of parallel IN transfers. 32 seems to produce the most stable throughput on Windows. */
#define USB_IN_TRANSFERS        32

struct dev_entry {
    uint16_t vendor_id;
    uint16_t device_id;
    const char *vendor_name;
    const char *device_name;
};

/* We need to use many queued IN transfers for any resemblance of performance (especially on Windows)
 * because USB spec says that transfers end on non-full packets and the device sends the 31 reply
 * data bytes to each 32-byte packet with command + 31 bytes of data... */
static struct libusb_transfer *transfer_out = NULL;
static struct libusb_transfer *transfer_ins[USB_IN_TRANSFERS] = {0};
struct libusb_device_handle *esp32_cdc_handle = NULL;

const struct dev_entry devs_esp32_cdc[] = {
    {0x303A, 0x4001, "ESP32", "CDC"},
    {0},
};

enum trans_state {TRANS_ACTIVE = -2, TRANS_ERR = -1, TRANS_IDLE = 0};

#if 1
static void print_hex(const void *buf, size_t len)
{
    size_t i;
    for (i = 0; i < len; i++) {
        printf(" %02x", ((uint8_t *)buf)[i]);
        if (i % ESP32_CDC_PACKET_LENGTH == ESP32_CDC_PACKET_LENGTH - 1)
            printf("\n");
    }
}
#endif

static void cb_common(const char *func, struct libusb_transfer *transfer)
{
    int *transfer_cnt = (int*)transfer->user_data;

    if (transfer->status == LIBUSB_TRANSFER_CANCELLED) {
        /* Silently ACK and exit. */
        *transfer_cnt = TRANS_IDLE;
        return;
    }

    if (transfer->status != LIBUSB_TRANSFER_COMPLETED) {
        printf("\n%s: error: %s\n", func, libusb_error_name(transfer->status));
        *transfer_cnt = TRANS_ERR;
    } else {
        *transfer_cnt = transfer->actual_length;
    }
}

/* callback for bulk out async transfer */
static void LIBUSB_CALL cb_out(struct libusb_transfer *transfer)
{
    cb_common(__func__, transfer);
}

/* callback for bulk in async transfer */
static void LIBUSB_CALL cb_in(struct libusb_transfer *transfer)
{
    cb_common(__func__, transfer);
}

static int32_t usb_transfer(const char *func, unsigned int writecnt, unsigned int readcnt, const uint8_t *writearr, uint8_t *readarr)
{
    if (esp32_cdc_handle == NULL)
        return -1;

    int state_out = TRANS_IDLE;
    transfer_out->buffer = (uint8_t*)writearr;
    transfer_out->length = writecnt;
    transfer_out->user_data = &state_out;

    /* Schedule write first */
    if (writecnt > 0) {
        state_out = TRANS_ACTIVE;
        int ret = libusb_submit_transfer(transfer_out);
        if (ret) {
            printf("%s: failed to submit OUT transfer: %s\n", func, libusb_error_name(ret));
            state_out = TRANS_ERR;
            goto err;
        }
    }

    /* Handle all asynchronous packets as long as we have stuff to write or read. The write(s) simply need
     * to complete but we need to scheduling reads as long as we are not done. */
    unsigned int free_idx = 0; /* The IN transfer we expect to be free next. */
    unsigned int in_idx = 0; /* The IN transfer we expect to be completed next. */
    unsigned int in_done = 0;
    unsigned int in_active = 0;
    unsigned int out_done = 0;
    uint8_t *in_buf = readarr;
    int state_in[USB_IN_TRANSFERS] = {0};
    do {
        /* Schedule new reads as long as there are free transfers and unscheduled bytes to read. */
        while ((in_done + in_active) < readcnt && state_in[free_idx] == TRANS_IDLE) {
            unsigned int cur_todo = min(ESP32_CDC_PACKET_LENGTH - 1, readcnt - in_done - in_active);
            transfer_ins[free_idx]->length = cur_todo;
            transfer_ins[free_idx]->buffer = in_buf;
            transfer_ins[free_idx]->user_data = &state_in[free_idx];
            int ret = libusb_submit_transfer(transfer_ins[free_idx]);
            if (ret) {
                state_in[free_idx] = TRANS_ERR;
                printf("%s: failed to submit IN transfer: %s\n",
                     func, libusb_error_name(ret));
                goto err;
            }
            in_buf += cur_todo;
            in_active += cur_todo;
            state_in[free_idx] = TRANS_ACTIVE;
            free_idx = (free_idx + 1) % USB_IN_TRANSFERS; /* Increment (and wrap around). */
        }

        /* Actually get some work done. */
        libusb_handle_events_timeout(NULL, &(struct timeval){1, 0});

        /* Check for the write */
        if (out_done < writecnt) {
            if (state_out == TRANS_ERR) {
                goto err;
            } else if (state_out > 0) {
                out_done += state_out;
                state_out = TRANS_IDLE;
            }
        }
        /* Check for completed transfers. */
        while (state_in[in_idx] != TRANS_IDLE && state_in[in_idx] != TRANS_ACTIVE) {
            if (state_in[in_idx] == TRANS_ERR) {
                goto err;
            }
            /* If a transfer is done, record the number of bytes read and reuse it later. */
            in_done += state_in[in_idx];
            in_active -= state_in[in_idx];
            state_in[in_idx] = TRANS_IDLE;
            in_idx = (in_idx + 1) % USB_IN_TRANSFERS; /* Increment (and wrap around). */
        }
    } while ((out_done < writecnt) || (in_done < readcnt));
#if 1
    if (out_done > 0) {
        printf("Wrote %d bytes:\n", out_done);
        print_hex(writearr, out_done);
        printf("\n\n");
    }
    if (in_done > 0) {
        printf("Read %d bytes:\n", in_done);
        print_hex(readarr, in_done);
        printf("\n\n");
    }
#endif
    return 0;
err:
    /* Clean up on errors. */
    printf("%s: Failed to %s %d bytes\n", func, (state_out == TRANS_ERR) ? "write" : "read",
         (state_out == TRANS_ERR) ? writecnt : readcnt);
    /* First, we must cancel any ongoing requests and wait for them to be canceled. */
    if ((writecnt > 0) && (state_out == TRANS_ACTIVE)) {
        if (libusb_cancel_transfer(transfer_out) != 0)
            state_out = TRANS_ERR;
    }
    if (readcnt > 0) {
        unsigned int i;
        for (i = 0; i < USB_IN_TRANSFERS; i++) {
            if (state_in[i] == TRANS_ACTIVE)
                if (libusb_cancel_transfer(transfer_ins[i]) != 0)
                    state_in[i] = TRANS_ERR;
        }
    }

    /* Wait for cancellations to complete. */
    while (1) {
        bool finished = true;
        if ((writecnt > 0) && (state_out == TRANS_ACTIVE))
            finished = false;
        if (readcnt > 0) {
            unsigned int i;
            for (i = 0; i < USB_IN_TRANSFERS; i++) {
                if (state_in[i] == TRANS_ACTIVE)
                    finished = false;
            }
        }
        if (finished)
            break;
        libusb_handle_events_timeout(NULL, &(struct timeval){1, 0});
    }
    return -1;
}

/*   Set the I2C bus speed (speed(b1b0): 0 = 20kHz; 1 = 100kHz, 2 = 400kHz, 3 = 750kHz).
 *   Set the SPI bus data width (speed(b2): 0 = Single, 1 = Double).  */
int esp32_config_stream(unsigned int speed)
{
    if (esp32_cdc_handle == NULL)
        return -1;

    uint8_t buf[] = {
        CH341A_CMD_I2C_STREAM,
        CH341A_CMD_I2C_STM_SET | (speed & 0x7),
        CH341A_CMD_I2C_STM_END
    };

    int32_t ret = usb_transfer(__func__, sizeof(buf), 0, buf, NULL);
    if (ret < 0) {
        printf("Could not configure stream interface.\n");
    }
    return ret;
}

/* ch341 requires LSB first, swap the bit order before send and after receive */
static uint8_t swap_byte(uint8_t x)
{
    x = ((x >> 1) & 0x55) | ((x << 1) & 0xaa);
    x = ((x >> 2) & 0x33) | ((x << 2) & 0xcc);
    x = ((x >> 4) & 0x0f) | ((x << 4) & 0xf0);
    return x;
}

int esp32_cdc_send_command(unsigned int writecnt, unsigned int readcnt, const unsigned char *writearr, unsigned char *readarr)
{
    int32_t ret = 0;

    if (esp32_cdc_handle == NULL)
        return -1;

    /* How many packets ... */
    const size_t packets = (writecnt + readcnt + ESP32_CDC_PACKET_LENGTH - 2) / (ESP32_CDC_PACKET_LENGTH - 1);

    /* We pluck CS/timeout handling into the first packet thus we need to allocate one extra package. */
    uint8_t wbuf[packets+1][ESP32_CDC_PACKET_LENGTH];
    uint8_t rbuf[writecnt + readcnt];
    /* Initialize the write buffer to zero to prevent writing random stack contents to device. */
    memset(wbuf[0], 0, ESP32_CDC_PACKET_LENGTH);

    uint8_t *ptr = wbuf[0];
    /* CS usage is optimized by doing both transitions in one packet.
     * Final transition to deselected state is in the pin disable. */
    unsigned int write_left = writecnt;
    unsigned int read_left = readcnt;
    unsigned int p;
    for (p = 0; p < packets; p++) {
        unsigned int write_now = min(ESP32_CDC_PACKET_LENGTH - 1, write_left);
        unsigned int read_now = min ((ESP32_CDC_PACKET_LENGTH - 1) - write_now, read_left);
        ptr = wbuf[p + 1];
        *ptr++ = 0x01;
        unsigned int i;
        for (i = 0; i < write_now; ++i)
            *ptr++ = swap_byte(*writearr++);
        if (read_now) {
            memset(ptr, 0xFF, read_now);
            read_left -= read_now;
        }
        write_left -= write_now;
    }

    ret = usb_transfer(__func__, ESP32_CDC_PACKET_LENGTH + packets + writecnt + readcnt,
                    writecnt + readcnt, wbuf[0], rbuf);

    if (ret < 0)
        return -1;

    unsigned int i;
    for (i = 0; i < readcnt; i++) {
        *readarr++ = swap_byte(rbuf[writecnt + i]);
    }

    return 0;
}

int esp32_cdc_shutdown(void)
{
    if (esp32_cdc_handle == NULL)
        return -1;

    //enable_pins(false);
    libusb_free_transfer(transfer_out);
    transfer_out = NULL;
    int i;
    for (i = 0; i < USB_IN_TRANSFERS; i++) {
        libusb_free_transfer(transfer_ins[i]);
        transfer_ins[i] = NULL;
    }
    libusb_release_interface(esp32_cdc_handle, 0);
    libusb_close(esp32_cdc_handle);
    libusb_exit(NULL);
    esp32_cdc_handle = NULL;
    return 0;
}

int esp32_cdc_init(void)
{
    if (esp32_cdc_handle != NULL) {
        printf("%s: esp32_cdc_handle already set!\n", __func__);
        return -1;
    }

    int32_t ret = libusb_init(NULL);
    if (ret < 0) {
        printf("Couldnt initialize libusb!\n");
        return -1;
    }
#if LIBUSB_API_VERSION >= 0x01000106
    libusb_set_option(NULL, LIBUSB_OPTION_LOG_LEVEL, 3);
#else
    libusb_set_debug(NULL, 3); // Enable information, warning and error messages (only).
#endif
    uint16_t vid = devs_esp32_cdc[0].vendor_id;
    uint16_t pid = devs_esp32_cdc[0].device_id;
    esp32_cdc_handle = libusb_open_device_with_vid_pid(NULL, vid, pid);
    if (esp32_cdc_handle == NULL) {
        printf("Couldn't open device %04x:%04x.\n", vid, pid);
        return -1;
    }
    printf("Found programmer device: %s - %s\n", devs_esp32_cdc[0].vendor_name, devs_esp32_cdc[0].device_name);

#ifdef __gnu_linux__
    /* libusb_detach_kernel_driver() and friends basically only work on Linux. We simply try to detach on Linux
     * without a lot of passion here. If that works fine else we will fail on claiming the interface anyway. */
    ret = libusb_detach_kernel_driver(esp32_cdc_handle, 0);
    if (ret == LIBUSB_ERROR_NOT_SUPPORTED) {
        printf("Detaching kernel drivers is not supported. Further accesses may fail.\n");
    } else if (ret != 0 && ret != LIBUSB_ERROR_NOT_FOUND) {
        printf("Failed to detach kernel driver: '%s'. Further accesses will probably fail.\n",
              libusb_error_name(ret));
    }
#endif

    ret = libusb_claim_interface(esp32_cdc_handle, 0);
    if (ret != 0) {
        printf("Failed to claim interface 0: '%s'\n", libusb_error_name(ret));
        goto close_handle;
    }

    struct libusb_device *dev;
    if (!(dev = libusb_get_device(esp32_cdc_handle))) {
        printf("Failed to get device from device esp32_cdc_handle.\n");
        goto close_handle;
    }

    struct libusb_device_descriptor desc;
    ret = libusb_get_device_descriptor(dev, &desc);
    if (ret < 0) {
        printf("Failed to get device descriptor: '%s'\n", libusb_error_name(ret));
        goto release_interface;
    }

    printf("Device revision is %d.%01d.%01d\n",
        (desc.bcdDevice >> 8) & 0x00FF,
        (desc.bcdDevice >> 4) & 0x000F,
        (desc.bcdDevice >> 0) & 0x000F);

    /* Allocate and pre-fill transfer structures. */
    transfer_out = libusb_alloc_transfer(0);
    if (!transfer_out) {
        printf("Failed to alloc libusb OUT transfer\n");
        goto release_interface;
    }
    int i;
    for (i = 0; i < USB_IN_TRANSFERS; i++) {
        transfer_ins[i] = libusb_alloc_transfer(0);
        if (transfer_ins[i] == NULL) {
            printf("Failed to alloc libusb IN transfer %d\n", i);
            goto dealloc_transfers;
        }
    }
    /* We use these helpers but dont fill the actual buffer yet. */
    libusb_fill_bulk_transfer(transfer_out, esp32_cdc_handle, WRITE_EP, NULL, 0, cb_out, NULL, USB_TIMEOUT);
    for (i = 0; i < USB_IN_TRANSFERS; i++)
        libusb_fill_bulk_transfer(transfer_ins[i], esp32_cdc_handle, READ_EP, NULL, 0, cb_in, NULL, USB_TIMEOUT);
    
    if ((esp32_config_stream(0X03) < 0))
        goto dealloc_transfers;

    return 0;

dealloc_transfers:
    for (i = 0; i < USB_IN_TRANSFERS; i++) {
        if (transfer_ins[i] == NULL)
            break;
        libusb_free_transfer(transfer_ins[i]);
        transfer_ins[i] = NULL;
    }
    libusb_free_transfer(transfer_out);
    transfer_out = NULL;
release_interface:
    libusb_release_interface(esp32_cdc_handle, 0);
close_handle:
    libusb_close(esp32_cdc_handle);
    esp32_cdc_handle = NULL;
    return -1;
}
